Tekla Open API Reference for Tekla Structures 2025
SpiralBeamDataException Fields
The SpiralBeamDataException type exposes the following members.
Fields
Name | Description
ErrorStatus
 Contains error status during spiral beam creation/modification.
Top
See Also
Reference
SpiralBeamDataException Class
Tekla.Structures.Model Namespace